In [1]:
import pandas as pd
import numpy as np

In [2]:
date= pd.read_csv('orders.csv')
time= pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()  ## by default date and time will string

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## working with dates

In [7]:
## converting to datetime dataype
date['date']=pd.to_datetime(date['date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## 1.extract year

In [9]:
date['date_year']=date['date'].dt.year ## dt== date time

date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

## 2.extract month

In [10]:
date['date_month']=date['date'].dt.month

date.head()

        date  product_id  city_id  orders  date_year  date_month
0 2019-12-10        5628       25       3       2019          12
1 2018-08-15        3646       14     157       2018           8
2 2018-10-23        1859       25       1       2018          10
3 2019-08-17        7292       25       1       2019           8
4 2019-01-06        4344       25       3       2019           1

In [11]:
date['date_month']=date['date'].dt.month_name()

date.head()

        date  product_id  city_id  orders  date_year date_month
0 2019-12-10        5628       25       3       2019   December
1 2018-08-15        3646       14     157       2018     August
2 2018-10-23        1859       25       1       2018    October
3 2019-08-17        7292       25       1       2019     August
4 2019-01-06        4344       25       3       2019    January

## 3.extract days

In [12]:
date['date_days']=date['date'].dt.day

date.head()

        date  product_id  city_id  orders  date_year date_month  date_days
0 2019-12-10        5628       25       3       2019   December         10
1 2018-08-15        3646       14     157       2018     August         15
2 2018-10-23        1859       25       1       2018    October         23
3 2019-08-17        7292       25       1       2019     August         17
4 2019-01-06        4344       25       3       2019    January          6

In [13]:
## day of week

date['date_days']=date['date'].dt.dayofweek

date.head()

        date  product_id  city_id  orders  date_year date_month  date_days
0 2019-12-10        5628       25       3       2019   December          1
1 2018-08-15        3646       14     157       2018     August          2
2 2018-10-23        1859       25       1       2018    October          1
3 2019-08-17        7292       25       1       2019     August          5
4 2019-01-06        4344       25       3       2019    January          6

In [14]:
## day of week_name 

date['date_dow_name']=date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

        date  date_year date_month  date_days date_dow_name
0 2019-12-10       2019   December          1       Tuesday
1 2018-08-15       2018     August          2     Wednesday
2 2018-10-23       2018    October          1       Tuesday
3 2019-08-17       2019     August          5      Saturday
4 2019-01-06       2019    January          6        Sunday

In [15]:
## is weekend

date['date_is_weekend']= np.where(date['date_dow_name'].isin(['Sunday','Saturday']),1,0)

date.drop(columns=['product_id','city_id','orders']).head()

        date  date_year date_month  date_days date_dow_name  date_is_weekend
0 2019-12-10       2019   December          1       Tuesday                0
1 2018-08-15       2018     August          2     Wednesday                0
2 2018-10-23       2018    October          1       Tuesday                0
3 2019-08-17       2019     August          5      Saturday                1
4 2019-01-06       2019    January          6        Sunday                1

In [16]:
## extract week of the year

date['date_week']=date['date'].dt.isocalendar().week

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_days,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,December,1,Tuesday,0,50
1,2018-08-15,2018,August,2,Wednesday,0,33
2,2018-10-23,2018,October,1,Tuesday,0,43
3,2019-08-17,2019,August,5,Saturday,1,33
4,2019-01-06,2019,January,6,Sunday,1,1

In [17]:
## extract quarter
date['quarter']=date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_days,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,December,1,Tuesday,0,50,4
1,2018-08-15,2018,August,2,Wednesday,0,33,3
2,2018-10-23,2018,October,1,Tuesday,0,43,4
3,2019-08-17,2019,August,5,Saturday,1,33,3
4,2019-01-06,2019,January,6,Sunday,1,1,1

## extract time elapsed between dates

In [18]:
import datetime

today=datetime.datetime.today()

today

datetime.datetime(2025, 1, 7, 11, 31, 13, 299410)

In [19]:
today - date['date']

0     1855 days 11:31:13.299410
1     2337 days 11:31:13.299410
2     2268 days 11:31:13.299410
3     1970 days 11:31:13.299410
4     2193 days 11:31:13.299410
                 ...
995   2283 days 11:31:13.299410
996   2224 days 11:31:13.299410
997   2072 days 11:31:13.299410
998   2137 days 11:31:13.299410
999   1911 days 11:31:13.299410
Name: date, Length: 1000, dtype: timedelta64[ns]

In [20]:
(today-date['date']).dt.days

0      1855
1      2337
2      2268
3      1970
4      2193
       ...
995    2283
996    2224
997    2072
998    2137
999    1911
Name: date, Length: 1000, dtype: int64

In [21]:
## month passed

np.round((today-date['date'])/np.timedelta64(1,'M'),0)

0      60.0
1      75.0
2      73.0
3      64.0
4      71.0
       ...
995    74.0
996    72.0
997    67.0
998    69.0
999    62.0
Name: date, Length: 1000, dtype: float64

In [22]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [23]:
##  converting to the datetime datatype

time['date']=pd.to_datetime(time['date'])

In [24]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [26]:
time['hour']=time['date'].dt.hour
time['min']=time['date'].dt.minute
time['sec']=time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

## extract time part

In [27]:
time['time']=time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

## time difference

In [28]:
today-time['date']

0     4041 days 10:41:13.299410
1     3905 days 11:51:13.299410
2     4391 days 11:10:13.299410
3     3693 days 11:00:13.299410
4     4090 days 12:20:13.299410
                 ...
995   4680 days 10:41:13.299410
996   4001 days 12:17:13.299410
997   4466 days 11:54:13.299410
998   4582 days 11:57:13.299410
999   3854 days 12:06:13.299410
Name: date, Length: 1000, dtype: timedelta64[ns]

In [29]:
## in hours

(today-time['date'])/np.timedelta64(1,'h')

0       96994.687028
1       93731.853694
2      105395.170361
3       88643.003694
4       98172.337028
           ...
995    112330.687028
996     96036.287028
997    107195.903694
998    109979.953694
999     92508.103694
Name: date, Length: 1000, dtype: float64